package com.hzz.hzzcloud.公司临时代码.根据exl表头创建表语句;

/**
 * @author ：hzz
 * @description：TODO
 * @date ：2020/12/16 17:04
 */
public class test2 {

    public static void main(String[] args) {
        String name = "微型轿车\n" +
                "小型轿车\n" +
                "微型普通客车\n" +
                "小型普通客车\n" +
                "小型越野客车\n" +
                "中型普通客车\n" +
                "微型普通货车\n" +
                "轻型封闭货车\n" +
                "轻型普通货车\n" +
                "轻型厢式货车\n" +
                "中型仓栅式货车\n" +
                "中型平板货车\n" +
                "中型普通货车\n" +
                "中型厢式货车\n" +
                "重型仓栅式货车\n" +
                "重型车辆运输车\n" +
                "重型集装厢车\n" +
                "重型平板货车\n" +
                "重型普通货车\n" +
                "重型厢式货车\n" +
                "轻型半挂牵引车\n" +
                "中型半挂牵引车\n" +
                "重型半挂牵引车\n" +
                "重型全挂牵引车\n" +
                "轻型罐式货车\n" +
                "中型罐式货车\n" +
                "重型罐式货车\n" +
                "轻型自卸货车\n" +
                "中型自卸货车\n" +
                "中型特殊结构自卸货车\n" +
                "重型平板自卸货车\n" +
                "重型罐式自卸货车\n" +
                "重型特殊结构自卸货车\n" +
                "重型厢式自卸货车\n" +
                "重型自卸货车\n" +
                "轻型非载货专项作业车\n" +
                "轻型特殊结构货车\n" +
                "微型非载货专项作业车\n" +
                "微型特殊结构货车\n" +
                "中型特殊结构货车\n" +
                "大型载货专项作业车\n" +
                "重型特殊结构货车\n" +
                "重型载货专项作业车\n" +
                "轻型平板半挂车\n" +
                "轻型普通半挂车\n" +
                "中型集装箱半挂车\n" +
                "中型平板半挂车\n" +
                "中型普通半挂车\n" +
                "中型特殊结构半挂车\n" +
                "中型厢式半挂车\n" +
                "中型厢式全挂车\n" +
                "重型仓栅式半挂车\n" +
                "重型车辆运输半挂车\n" +
                "重型低平板半挂车\n" +
                "重型罐式半挂车\n" +
                "重型集装箱半挂车\n" +
                "重型集装箱全挂车\n" +
                "重型平板半挂车\n" +
                "重型平板全挂车\n" +
                "重型普通半挂车\n" +
                "重型特殊结构半挂车\n" +
                "重型厢式半挂车\n" +
                "重型中置轴普通挂车\n" +
                "重型专项作业半挂车\n" +
                "轻型平板自卸半挂车\n" +
                "中型平板自卸半挂车\n" +
                "中型平板自卸全挂车\n" +
                "重型仓栅式自卸半挂车\n" +
                "重型低平板自卸半挂车\n" +
                "重型罐式自卸半挂车\n" +
                "重型集装箱自卸半挂车\n" +
                "重型平板自卸半挂车\n" +
                "重型平板自卸全挂车\n" +
                "重型自卸半挂车\n" +
                "其它\n" +
                "三轮汽车";

        String name2 = "40\n" +
                "39\n" +
                "38\n" +
                "37\n" +
                "37\n" +
                "36\n" +
                "35\n" +
                "35\n" +
                "35\n" +
                "35\n" +
                "34\n" +
                "34\n" +
                "34\n" +
                "34\n" +
                "33\n" +
                "33\n" +
                "33\n" +
                "33\n" +
                "33\n" +
                "33\n" +
                "32\n" +
                "31\n" +
                "30\n" +
                "30\n" +
                "29\n" +
                "28\n" +
                "27\n" +
                "26\n" +
                "25\n" +
                "24\n" +
                "23\n" +
                "22\n" +
                "21\n" +
                "20\n" +
                "19\n" +
                "18\n" +
                "17\n" +
                "16\n" +
                "15\n" +
                "14\n" +
                "13\n" +
                "12\n" +
                "11\n" +
                "10\n" +
                "10\n" +
                "9\n" +
                "9\n" +
                "9\n" +
                "9\n" +
                "9\n" +
                "9\n" +
                "8\n" +
                "8\n" +
                "8\n" +
                "8\n" +
                "8\n" +
                "7\n" +
                "7\n" +
                "7\n" +
                "7\n" +
                "7\n" +
                "6\n" +
                "6\n" +
                "6\n" +
                "5\n" +
                "4\n" +
                "4\n" +
                "3\n" +
                "3\n" +
                "3\n" +
                "3\n" +
                "3\n" +
                "3\n" +
                "3\n" +
                "2\n" +
                "1";

        String[] split = name.split("\n");
        String[] split1 = name2.split("\n");
        String sql = "";
        for (int i = 0; i < split.length; i++) {

            String s = split[i];
            String score=split1[i];
            sql += "else if (\"" + s + "\".equalsIgnoreCase(data)) {\n" +
                    "                score = "+score+";\n" +
                    "            } \n";
        }
        System.out.println(sql
        );

    }
}
